import Image from "next/image"
import HilightedTitle from "../Components/HilightedTitle"
import styles from "../styles/HomePage.module.css"
import GradientTitle from "../Components/GradientTitle"
import { CardTriangle } from "../Components/CardTriangle"
import ProcessSteps from "../Components/webdesign-steps"
import ConsultationForm from "../Components/requestform"

const page = () => {
    return (
        <div style={{ display: 'flex', flexDirection: 'column' , marginTop: 'calc(20vh - 4%)'}}>
            <section style={{ padding: ' 0px 30px', marginTop: '0' }} className={styles.sectionNeed}>
                <div className={styles.sectionNeed__Right}>
                    <div style={{ position: 'relative', display: 'flex', flexDirection: 'column', alignItems: 'flex-start', width: '100%' }}>
                        <HilightedTitle
                            topSvgOffset={'-15px'}
                            topSvgLeftOffset={'13px'}
                            bottomSvgOffset={'-12px'}
                            bottomSvgRightOffset={'0px'}>
                            <p style={{
                                fontSize: '30px',
                                color: '#FFBA3B',
                                fontFamily: 'koolak',
                                textAlign: 'right',
                                marginRight: '-28px',
                                marginBottom: '10px'
                            }}>
                                کــسب و کــار شــما چه <span style={{ color: '#175DE3' }}>نـــیازی بــه سایـــت</span> دارد ؟
                            </p>
                        </HilightedTitle>
                        {/* <Image
              src={arrow}
              style={{
                position: 'absolute',
                top: '45px',
                right: '405px',
                zIndex: 3,
                width: '53.35px',
                height: '30.44px'
              }} */}
                        {/* /> */}
                    </div>
                    <p
                        style={{
                            textAlign: 'justify',
                            fontWeight: '500',
                            maxWidth: '650px',
                            width: '100%'
                        }}
                        className={styles.sectionNeed__RightText}
                    >
                        تیم سـایمون از دل یک باور ساده متولد شد که هر کسب‌وکاری، هرچقدر هم کوچک، سزاوار حضوری قدرتمند در دنیای دیجیتال است. ما جمعی از معماران دیجیتال، طراحان خلاق و استراتژیست‌های حرفه‌ای هستیم که کنار هم آمده‌ایم تا برندها را از صفر تا اوج همراهی کنیم. در تیم سایمون، سایت فقط یک ابزار نیست ؛ خـانه دیجــیتال شماست که با دقت، خلاقیت و عشق ساخته می‌شود.تیم سـایمون از دل یک باور ساده متولد شد که هر کسب‌وکاری، هرچقدر هم کوچک، سزاوار حضوری قدرتمند در دنیای دیجیتال است. ما جمعی از معماران دیجیتال، طراحان خلاق و استراتژیست‌های حرفه‌ای هستیم.
                    </p>

                    <div style={{ display: 'flex', gap: '1.4rem', marginTop: '20px' }}>

                        <div style={{ display: 'flex', alignItems: 'center', gap: '1rem' }}>
                            <span dir="ltr" style={{ fontSize: '3rem', color: '#FFBA3B', textWrap: 'nowrap' }}>+  100</span>
                            <div style={{ fontFamily: 'estedad' }}>
                                <div style={{ fontSize: '18px', fontWeight: '600', color: '#545658' }}>پروژه موفق</div>
                                <div style={{ fontSize: '11px', fontWeight: '500', color: '#545658' }}>با همراهی معتبر برند های کشور</div>
                            </div>
                        </div>

                        <div style={{ display: 'flex', alignItems: 'center' }}>
                            <svg width="2" height="72" viewBox="0 0 2 72" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <line x1="1" y1="72" x2="1" stroke="url(#paint0_linear_706_288)" strokeWidth="2" />
                                <defs>
                                    <linearGradient id="paint0_linear_706_288" x1="2.5" y1="0" x2="2.5" y2="72" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#FFFAFA" stopOpacity="0.8" />
                                        <stop offset="0.5" stopColor="#175DE3" />
                                        <stop offset="1" stopColor="#FFFAFA" stopOpacity="0.8" />
                                    </linearGradient>
                                </defs>
                            </svg>
                        </div>

                        <div style={{ display: 'flex', alignItems: 'center', gap: '1rem' }}>
                            <span dir="ltr" style={{ fontSize: '3rem', color: '#FFBA3B', textWrap: 'nowrap' }}>+  80</span>
                            <div style={{ fontFamily: 'estedad' }}>
                                <div style={{ fontSize: '18px', fontWeight: '600', color: '#545658' }}>پروژه موفق</div>
                                <div style={{ fontSize: '11px', fontWeight: '500', color: '#545658' }}>با همراهی معتبر برند های کشور</div>
                            </div>
                        </div>

                    </div>
                </div>

                <div className={styles.sectionNeed__Left}>
                    <svg className="leftSVG" width="100%" height="854" viewBox="0 0 793 854" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M381.011 170.908C438.874 236.242 468.473 241.188 540.74 277.673C599.753 307.524 658.957 365.071 680.292 436.272C736.517 623.867 505.981 645.299 396.257 613.8C318.956 591.622 287.1 541.832 265.75 459.482C257.44 427.461 254.475 392.873 241.328 362.337C227.199 329.539 199.358 313.406 185.125 284.597C115.837 144.941 303.892 83.8571 381.011 170.908Z" fill="#FFBA3B" />
                        <path d="M90.2783 302.179H88.5703V334.973H90.2783V302.179Z" fill="#175DE3" />
                        <path d="M90.2783 347.356H88.5703V362.42H90.2783V347.356Z" fill="#175DE3" />
                        <path d="M556.085 220.861H112.022C102.042 220.861 93.9512 228.952 93.9512 238.932V517.234C93.9512 527.214 102.042 535.304 112.022 535.304H556.085C566.065 535.304 574.155 527.214 574.155 517.234V238.932C574.155 228.952 566.065 220.861 556.085 220.861Z" fill="#175DE3" />
                        <path d="M99.9629 238.915L99.9629 517.234C99.9629 523.884 105.354 529.275 112.004 529.275H556.084C562.735 529.275 568.126 523.884 568.126 517.234V238.915C568.126 232.265 562.735 226.874 556.084 226.874H112.004C105.354 226.874 99.9629 232.265 99.9629 238.915Z" fill="white" />
                        <path d="M279.85 480.665V529.292H388.205V480.665C388.205 476.135 386.406 471.791 383.203 468.588C379.999 465.385 375.655 463.585 371.125 463.585H296.878C292.357 463.599 288.026 465.404 284.834 468.606C281.642 471.808 279.85 476.144 279.85 480.665Z" fill="#FFBA3B" />
                        <path d="M416.865 480.665V529.292H525.272V480.665C525.272 476.135 523.473 471.791 520.269 468.588C517.066 465.385 512.722 463.585 508.192 463.585H433.894C429.373 463.599 425.042 465.404 421.85 468.606C418.658 471.808 416.865 476.144 416.865 480.665Z" fill="#FFBA3B" />
                        <path d="M142.816 480.665V529.292H251.24V480.665C251.24 476.135 249.441 471.791 246.238 468.588C243.035 465.385 238.69 463.585 234.16 463.585H159.862C155.338 463.594 151.003 465.398 147.807 468.6C144.611 471.802 142.816 476.141 142.816 480.665Z" fill="#FFBA3B" />
                        <path d="M489.473 257.344H520.917C522.072 257.344 523.18 256.885 523.997 256.069C524.813 255.252 525.272 254.144 525.272 252.989C525.272 252.417 525.16 251.851 524.941 251.322C524.722 250.794 524.401 250.314 523.997 249.909C523.592 249.505 523.112 249.184 522.584 248.965C522.055 248.746 521.489 248.634 520.917 248.634H489.473C488.319 248.638 487.214 249.098 486.398 249.914C485.582 250.73 485.122 251.835 485.117 252.989C485.122 254.143 485.582 255.248 486.398 256.064C487.214 256.88 488.319 257.34 489.473 257.344Z" fill="#175DE3" />
                        <path d="M382.415 259.855C386.207 259.855 389.281 256.781 389.281 252.989C389.281 249.197 386.207 246.123 382.415 246.123C378.623 246.123 375.549 249.197 375.549 252.989C375.549 256.781 378.623 259.855 382.415 259.855Z" fill="#175DE3" />
                        <path d="M367.932 252.989C367.932 254.34 367.531 255.661 366.78 256.785C366.029 257.908 364.962 258.784 363.714 259.301C362.466 259.818 361.092 259.953 359.767 259.69C358.441 259.426 357.224 258.775 356.269 257.82C355.313 256.864 354.662 255.647 354.399 254.322C354.135 252.997 354.271 251.623 354.788 250.374C355.305 249.126 356.18 248.059 357.304 247.308C358.427 246.558 359.748 246.157 361.1 246.157C362.912 246.157 364.649 246.877 365.931 248.158C367.212 249.439 367.932 251.177 367.932 252.989Z" fill="#175DE3" />
                        <path d="M154.14 245.969H145.549C144.04 245.969 142.816 247.193 142.816 248.702V257.293C142.816 258.802 144.04 260.026 145.549 260.026H154.14C155.65 260.026 156.873 258.802 156.873 257.293V248.702C156.873 247.193 155.65 245.969 154.14 245.969Z" fill="#175DE3" />
                        <path opacity="0.2" d="M199.369 255.158H182.972C182.397 255.158 181.845 254.93 181.438 254.523C181.031 254.116 180.803 253.564 180.803 252.989C180.803 252.414 181.031 251.862 181.438 251.455C181.845 251.048 182.397 250.82 182.972 250.82H199.369C199.944 250.82 200.496 251.048 200.903 251.455C201.309 251.862 201.538 252.414 201.538 252.989C201.538 253.564 201.309 254.116 200.903 254.523C200.496 254.93 199.944 255.158 199.369 255.158Z" fill="#263238" />
                        <path opacity="0.2" d="M231.376 255.158H214.98C214.404 255.158 213.853 254.93 213.446 254.523C213.039 254.116 212.811 253.564 212.811 252.989C212.811 252.414 213.039 251.862 213.446 251.455C213.853 251.048 214.404 250.82 214.98 250.82H231.376C231.953 250.82 232.507 251.048 232.916 251.454C233.326 251.86 233.558 252.412 233.563 252.989C233.558 253.566 233.326 254.117 232.916 254.524C232.507 254.93 231.953 255.158 231.376 255.158Z" fill="#263238" />
                        <path opacity="0.2" d="M263.401 255.158H247.005C246.428 255.158 245.874 254.93 245.465 254.524C245.055 254.117 244.823 253.566 244.818 252.989C244.823 252.412 245.055 251.86 245.465 251.454C245.874 251.048 246.428 250.82 247.005 250.82H263.401C263.977 250.82 264.528 251.048 264.935 251.455C265.342 251.862 265.571 252.414 265.571 252.989C265.571 253.564 265.342 254.116 264.935 254.523C264.528 254.93 263.977 255.158 263.401 255.158Z" fill="#263238" />
                        <path opacity="0.2" d="M295.409 255.158H279.012C278.436 255.158 277.882 254.93 277.473 254.524C277.063 254.117 276.831 253.566 276.826 252.989C276.831 252.412 277.063 251.86 277.473 251.454C277.882 251.048 278.436 250.82 279.012 250.82H295.409C295.985 250.82 296.536 251.048 296.943 251.455C297.35 251.862 297.578 252.414 297.578 252.989C297.578 253.564 297.35 254.116 296.943 254.523C296.536 254.93 295.985 255.158 295.409 255.158Z" fill="#263238" />
                        <path opacity="0.4" d="M491.809 304.995H167.64C158.298 304.995 150.725 312.554 150.725 321.877V416.114C150.725 425.437 158.298 432.995 167.64 432.995H491.809C501.151 432.995 508.725 425.437 508.725 416.114V321.877C508.725 312.554 501.151 304.995 491.809 304.995Z" fill="#175DE3" />
                        <path opacity="0.4" d="M291.819 375.021L190.127 374.737C188.819 374.73 187.525 374.464 186.32 373.957C185.114 373.449 184.021 372.708 183.101 371.777C182.182 370.846 181.455 369.744 180.963 368.532C180.47 367.32 180.221 366.023 180.23 364.715C180.237 363.406 180.503 362.113 181.01 360.907C181.518 359.701 182.259 358.608 183.19 357.689C184.121 356.769 185.223 356.043 186.435 355.55C187.647 355.057 188.944 354.808 190.252 354.817L291.944 355.1C293.252 355.108 294.546 355.373 295.752 355.881C296.957 356.389 298.051 357.129 298.97 358.06C299.889 358.991 300.616 360.094 301.109 361.306C301.602 362.517 301.851 363.815 301.842 365.123C301.838 366.432 301.576 367.728 301.07 368.935C300.563 370.143 299.823 371.238 298.891 372.158C297.96 373.078 296.855 373.805 295.641 374.296C294.427 374.787 293.128 375.034 291.819 375.021Z" fill="#175DE3" />
                        <path opacity="0.4" d="M254.715 404.725L188.818 404.529C186.241 404.515 183.774 403.482 181.955 401.656C180.136 399.829 179.113 397.358 179.11 394.78C179.117 393.498 179.378 392.229 179.876 391.047C180.374 389.865 181.1 388.792 182.013 387.891C182.925 386.99 184.007 386.277 185.195 385.794C186.383 385.311 187.655 385.066 188.938 385.075L254.819 385.254C256.102 385.261 257.371 385.521 258.553 386.02C259.735 386.518 260.807 387.244 261.709 388.156C262.61 389.069 263.323 390.151 263.806 391.339C264.289 392.527 264.533 393.799 264.525 395.082C264.493 397.658 263.444 400.118 261.607 401.924C259.769 403.731 257.292 404.737 254.715 404.725Z" fill="#175DE3" />
                    </svg>

                </div>
            </section>

            {/* سرویس سایمون */}
            <section className={styles.servicesSection}>

                {/* استایل گلوبال */}
                <div className="BlueSquare"></div>

                <div className={styles.servicesSection__threeCont}>
                    <div className={styles.servicesSection__icon}>
                        <Image width={50} height={50} src={'/building.svg'} alt="icon"></Image>
                    </div>
                    <p className={styles.servicesSection__title}>سایت فروشگاهی</p>

                    {/* استایل گلوبال */}
                    <div className="backGradBlue"></div>
                    <div className="backGradOrange"></div>
                </div>

                <div className={styles.servicesSection__threeCont}>
                    <p>تیم سـایمون از دل یک باور ساده متولد شد که هر کسب‌وکاری، هرچقدر هم کوچک، سزاوار حضوری قدرتمند در دنیای دیجیتال است. ما جمعی از معماران دیجیتال، طراحان خلاق و استراتژیست‌های حرفه‌ای هستیم که کنار هم آمده‌ایم تا برندها را از تیم سـایمون از دل یک  خلاق و استراتژیست‌های حرفه‌ای هستیم که کنار هم آمده‌ایم تا برندها را از تیم تا برندها را از تیم سـایمون از دل یک  خلاق و استراتژیست‌هایکیا تا برندها را از تیم سـایمون از دل یک  خلاق و استراتژیست‌های حرفه‌ای هستیم که کنار هم آمده‌ایم تا برندها را از تیم تا برندها را از تیم سـایمون از دل یک  خلاق و استراتژیست‌هایکیا </p>
                </div>

                <div className={styles.servicesSection__threeCont}>
                    <div className={styles.servicesSection__icon}>
                        <Image width={50} height={50} src={'/building.svg'} alt="icon"></Image>
                    </div>
                    <p className={styles.servicesSection__title}>سایت شرکتی</p>
                    {/* استایل گلوبال */}
                    <div className="backGradBlue"></div>
                    <div className="backGradOrange"></div>
                </div>

            </section>

            <section style={{ display: 'flex', flexDirection: 'column' }}>
                <GradientTitle text1="Sample work" text2="نـــمونــــه کــــار" />

                <div className={styles.commentSection}>
                    <CardTriangle />
                    <CardTriangle />
                    <CardTriangle />
                </div>
            </section>

            <section style={{ display: 'flex', flexDirection: 'column', marginTop: '80px' }}>
                <GradientTitle text1="Website design steps" text2="مراحل طراحی سایت" />

                <ProcessSteps />

                <ConsultationForm />
            </section>
        </div>
    )
}
export default page